from telebot import TeleBot
import telebot
from telebot.types import ReplyKeyboardMarkup, KeyboardButton, Message, InputFile
import info
TOKEN = "6754967146:AAF7xmgkMjbgJv0vYPoIVW4OVrkv11Yhvps"
bot = telebot.TeleBot(TOKEN)

content = {
    'start': {
        'text': 'Привет, это бот с расписанием. В этом боте есть только глобальное расписание на 3-ю четверть. Из какого ты класса?',
        'buttons': ["5-й", "6-й", "7-й", "8-й", "9-й", "Я учитель"],
        'loose': False,
        'img': ''
    },
    "Я учитель": {
        'text': 'Какой вы учитель?',
        'buttons': ['Я учитель Мат/Физ/Инф', 'Я учитель Ин. яза', "Я учитель Рус.яз/Лит-ра"],
        'loose': False,
        'img': ''
    },
"Я учитель Рус.яз/Лит-ра": {
        'text': """На какой день вам нужно расписание?""",
        'buttons': ["Понедельник(рус)", "Вторник(рус)", "Среда(рус)", "Четверг(рус)", "Пятница(рус)"],
        'loose': False,
        'img': ''
    },
"Понедельник(рус)": {
        'text': """1. РОВ(7 кл.)
2. Рус. яз. (8 кл.)
3. Рус. яз. (5 кл.)
4. Рус. яз. (6 кл.)
5. Рус. яз. (7кл.)
6. Рус. яз.(9 кл.)""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Вторник(рус)': {
        'text': """1. Рус. яз. (6 кл.)
2. Рус. яз. (5 кл.)
3. Рус. яз. (7 кл.)
4. Литература (7 кл.)
5. Рус. яз. (9 кл.) 
6. Литература (9 кл.)""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Среда(рус)': {
        'text': """1. Рус. яз.(5 кл.)
2. Рус. яз. (6 кл.)
3. Рус. яз. (7 кл.)
4. Рус. яз. (8 кл.)
5. Рус. яз. (9 кл.)
6. Литература (9 кл.)""",
        'buttons': [],
        'loose': True,
        'img': ''
    },
'Четверг(рус)': {
        'text': """1. РМГ (7 кл.)
2. Рус. яз. (6 кл.)
3. Рус. яз. (6 кл.)
4. Рус. яз. (5 кл)
5. Рус. яз. (8 кл.)
6. Литература (8 кл.)""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Пятница(рус)': {
        'text': """1. Рус. яз. (7 кл.)
2 Литература (8 кл.)
3. Рус. яз. (6 кл.)
4. Рус. яз. (5 кл.)
5. Литература (9 кл.)
6. Литература (7 кл.)""",
    'buttons': [],
    'loose': False,
    'img': ''
    },
"Я учитель Ин. яза": {
        'text': """На какой день вам нужно расписание?""",
        'buttons': ["Понедельник(англ)", "Вторник(англ)", "Среда(англ)", "Четверг(англ)", "Пятница(англ)"],
        'loose': False,
        'img': ''
    },
"Понедельник(англ)": {
        'text': """1. РОВ(5 кл.)
2. Лиетаратура (6 кл.)
3. Ин. яз. (7 кл.)
4. Ин. яз. (9 кл.)
5. Ин. яз. (5 кл.)
6. Литература (5 кл.)
7. Ин. яз. Ф (7 кл.)
8. ВН ОПД (8 кл.)""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Вторник(англ)': {
        'text': """1. Ин. яз. (4 кл.)
2. Ин. яз. (6 кл.)
3. Ин. яз. (5 кл.)
4. Ин. яз. (8 кл.)
5. Литература (5 кл.) """,
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Среда(англ)': {
        'text': """1. Ин. яз./Чт. (3 кл.)
2. Ин. яз. (9 кл.)
3.Ин. яз./Чт. (2 кл.)
4. Ин. яз. (6 кл.)
5. Ин. яз. (4 кл.)
6. Литература (5 кл.)
7. Ин. яз. (8 кл.) """,
        'buttons': [],
        'loose': True,
        'img': ''
    },
'Четверг(англ)': {
        'text': """1. Ин. яз. (3 кл.)
2. Ин. яз. (5 кл.)
3. Ин. яз. (9 кл.)
4. ВН РМГ (8 кл)
5.Ин. яз. (7 кл.)
6. Литература (6 кл.)
7.ВН ФГ (5 кл.)""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Пятница(англ)': {
        'text': """1. Ин. яз./РЯ (2 кл.)
2. Ин. яз. (7 кл.)
3. -
4. Ин. яз. (8 кл.)
5. Ин. яз. (6 кл.)
6. Литература (6 класс)
7. ВН ОПД (7 кл.)""",
    'buttons': [],
    'loose': False,
    'img': ''
    },

"Понедельник(м)": {
        'text': """1. РОВ(8 кл.)
2. Математика(5 кл.)
3. Математика(6 кл.)
4. Математика (7 кл.)
5. Алгебра (8 кл.)
6. Физика (8 кл.)
7. Математика (9 кл.)
8. Физика (9кл.)""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Вторник(м)': {
        'text': """1. Математика (5 кл.)
2. Физика (9 кл.)
3. Математика (9 кл.)
4. Математика (6 кл.)
5. Математика (7 кл.)
6. Геометрия (8 кл.)
7. Информатика (7 кл.)
8. Информатика (8 кл.)""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Среда(м)': {
        'text': """1. Алгебра (8 кл.)
2. Вероятность и Статистика (-8 кл.)
3. Математика (6 кл.)
4. Математика (5 кл.)
5. Математика (7 кл.)
6. Физика (7 кл.)
7. Математика (9 кл.)
8. Информатика (9 кл.)""",
        'buttons': [],
        'loose': True,
        'img': ''
    },
'Четверг(м)': {
        'text': """1. Математика (5 кл.)
2. Математика (7 кл.)
3. Математика (7 кл.)
4. Математика (6 кл.)
5. Математика (9 кл.)
6. Математика (9 кл.)
7. Геометрия (8 кл.)
8. Физика (8 кл.)""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
'Пятница(м)': {
        'text': """1. Математика (5 кл.)
2. Математика (6 кл.)
3. Физика (7 кл.)
4. Математика (7 кл.)
5. Алгебра (8 кл.)
6. Математика (9 кл.)
7. Физика (9 кл.)
8. ВН ФГ (9 кл.)""",
    'buttons': [],
    'loose': False,
    'img': ''
    },
    '8-й': {
        'text': 'На какой день тебе нужно расписание?',
        'buttons': ['Понедельник(8)', 'Вторник(8)', "Среда(8)", "Четверг(8)", "Пятница(8)"],
        'loose': False,
        'img': ''
    },
    'Понедельник(8)': {
        'text': """1. РОВ
2. Рус. яз.
3. История
4. География
5. Алгебра
6. Физика
7. Химия Ф
8. ОПД""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Вторник(8)': {
        'text': """1. -
2. Биология
3. Химия
4. Ин.яз.
5. Физ-ра
6. Геометрия
7. ОБЖ
8. Информатика""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Среда(8)': {
        'text': """1. Алгебра
2. Вероятность и Статистика
3. История
4. Рус. яз
5. География
6. Физ-ра
7. Ин. яз.""",
        'buttons': [],
        'loose': True,
        'img': ''
    },
    'Четверг(8)': {
        'text': """1. -
2. Биология
3. Технология
4. РМГ
5. Рус. яз.
6. Литература
7. Геометрия
8. Физика""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Пятница(8)': {
        'text': """1. Химия
2. Литература
3. Общество
4. Ин. яз.
5. Математика
6. Музыка
7. ЛАФ""",
        'buttons': [],
        'loose': False,
        'img': ""
    },
    '7-й': {
        'text': 'На какой день тебе нужно расписание?',
        'buttons': ['Понедельник(7)', 'Вторник(7)', "Среда(7)", "Четверг(7)", "Пятница(7)"],
        'loose': False,
        'img': ''
    },
    'Понедельник(7)': {
        'text': """1. РОВ
2. География
3. Ин. яз. 
4. Математика
5. Рус. яз.
6. Экология Ф
7. Ин. яз.""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Вторник(7)': {
        'text': """1. Биология
2. История
3. Рус.яз
4. Литература
5. Математика
6. Музыка
7. Информатика""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Среда(7)': {
        'text': """1. Физ-ра
2. География
3. Рус. яз.
4. Обществознание
5. Математика
6. Физика
7. ИЗО""",
        'buttons': [],
        'loose': True,
        'img': ''
    },
    'Четверг(7)': {
        'text': """1. ВН РМГ
2. Математика
3. Математика
4. История
5. Ин. яз.
6. Технология
7. Технология""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Пятница(7)': {
        'text': """1. Рус. яз.
2. Ин. яз.
3. Математика
4. Физика
5. Физ-ра
6. Литература
7. ОПД""",
        'buttons': [],
        'loose': False,
        'img': ""
    },
    '9-й': {
        'text': 'На какой день тебе нужно расписание?',
        'buttons': ['Понедельник(9)', 'Вторник(9)', "Среда(9)", "Четверг(9)", "Пятница(9)"],
        'loose': False,
        'img': ''
    },
    'Понедельник(9)': {
        'text': """1. РОВ
2. История
3. География 
4. Ин. яз.
5. Технология 
6. Рус. яз.
7. Математика
8. Физика""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Вторник(9)': {
        'text': """1. Общество
2. Физика
3. Математика
4. Биология
5. Рус. яз.
6. Литература
7. Физ-ра""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Среда(9)': {
        'text': """1. -
2. Ин. яз.
3. Физ-ра
4. География
5. Рус. яз.
6. Литература
7. Математика
8. Информатика""",
        'buttons': [],
        'loose': True,
        'img': ''
    },
    'Четверг(9)': {
        'text': """1. РМГ
2. История
3. Ин. яз.
4. Химия
5. Математика
6. Математика""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Пятница(9)': {
        'text': """1. История
2. Химия
3. ОБЖ
4. Биология
5. Литература
6. Математика
7. Физика
8. ВН ФГ""",
        'buttons': [],
        'loose': False,
        'img': ""
    },
'6-й': {
        'text': 'На какой день тебе нужно расписание?',
        'buttons': ['Понедельник(6)', 'Вторник(6)', "Среда(6)", "Четверг(6)", "Пятница(6)"],
        'loose': False,
        'img': ''
    },
    'Понедельник(6)': {
        'text': """1. РОВ
2. Литература
3. Математика
4. Рус. яз.
5. Биология
6. ИЗО""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Вторник(6)': {
        'text': """1. Рус. яз.
2. Ин. яз.
3. История
4. Математика
5. ОДНКНР
6. Физ-ра
7. Музыка""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Среда(6)': {
        'text': """1. География
2. Рус. яз.
3. Математика
4. Ин. яз.
5. Технология
6. Технология
7. ГТО""",
        'buttons': [],
        'loose': True,
        'img': ''
    },
    'Четверг(6)': {
        'text': """1. РМГ
2. Рус. яз.
3. Рус. яз.
4. Математика
5. История
6. Литература""",
        'buttons': [],
        'loose': False,
        'img': ''
    },
    'Пятница(6)': {
        'text': """1. Физ-ра
2. Математика
3. Рус. яз.
4. Общество
5. Ин. яз.
6. Литература
7. Заг Ист Ф""",
        'buttons': [],
        'loose': False,
        'img': ""
    },
}

def knopki(buttons):
    keyboard = ReplyKeyboardMarkup(resize_keyboard=True)
    for ell in buttons:
        keyboard.add(KeyboardButton(ell))

    return keyboard

@bot.message_handler(commands=['start'])
def handler_start(message: Message):
    user_id = message.from_user.id
    data_location = content['start']
    keyword_now = knopki(data_location['buttons'])
    if data_location['img'] != '':
        img = open(data_location['img'], 'rb')
        bot.send_photo(chat_id=user_id, photo=img)
    bot.send_message(chat_id=user_id, text=data_location['text'], reply_markup=keyword_now)

@bot.message_handler(content_types=['text'])
def handler_text(message: Message):
    user_id = message.from_user.id
    if message.text in content:
        buttons = content[message.text]['buttons']
        if buttons:
            keyboard = knopki(buttons)
            bot.send_message(chat_id=user_id, text=content[message.text]['text'], reply_markup=keyboard)
        else:
            bot.send_message(chat_id=user_id, text=content[message.text]['text'])

bot.polling()
